icc/08_encapsulamiento.org
#+HTML_LINK_HOME: ../inicio.html
#+TITLE: Encapsulación, constructor y toString

Anteriormente vimos que los /atributos de clase/ deben escribirse como

#+begin_src java
  private String nombre;
  private int edad;
#+end_src

La palabra reservada ~private~ indica que solo puede ser usada esta
variable (o método también) *dentro de la misma clase y no
fuera*. Esto no tiene nada que ver con /proteger los datos de un
hacker/, pero sí protegerlo de /otras clases/ lo cual es parte de los
principios de la /Programación Orientada a Objetos (POO)/.

