icc/08_encapsulamiento.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-18 Fri 19:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Davidshiro Pichu" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../inicio.html"> HOME </a>
</div><div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgeba71c9">1. Encapsulación, constructor y toString</a>
<ul>
<li><a href="#org56e7c68">1.1. Ejemplo 1: Vaca y Pollito</a></li>
<li><a href="#org48573bf">1.2. Problema 1: Gatos++</a></li>
<li><a href="#org5f84811">1.3. Problema 2: Caja</a></li>
<li><a href="#org18461ca">1.4. Constructor</a></li>
<li><a href="#org8e084f2">1.5. ToString</a></li>
<li><a href="#org5cb960e">1.6. Problema 3 y 4. Cajas++</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgeba71c9" class="outline-2">
<h2 id="orgeba71c9"><span class="section-number-2">1.</span> Encapsulación, constructor y toString</h2>
<div class="outline-text-2" id="text-1">
<p>
Anteriormente vimos que los <i>atributos de clase</i> deben escribirse como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
<span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>;
</pre>
</div>

<p>
La palabra reservada <code>private</code> indica que solo puede ser usada esta
variable (o método también) <b>dentro de la misma clase y no
fuera</b>. Esto no tiene nada que ver con <i>proteger los datos de un
hacker</i>, pero sí protegerlo de <i>otras clases</i> lo cual es parte de los
principios de la <i>Programación Orientada a Objetos (POO)</i>.
</p>
</div>
