icc/08_encapsulamiento.org
* Ejemplo 1: Vaca y Pollito

Tenemos dos clases, /Vaca y Pollito/ *en 2 archivos diferentes* como:

#+begin_src java
  /* Archivo Vaca.java */
  import java.util.Scanner;

  public class Vaca {
      // Esto es inaceptable, solo es un ejemplo
      public String nombre;
      public String edad;

      public void inicializar(){
  	Scanner input = new Scanner(System.in);
  	System.out.print("Ingresa un nombre para la vaca: ");
  	nombre = input.nextLine();
  	System.out.print("Ingresa una edad de la vaca: ");
  	edad = input.nextLine();
      }

      public void imprimir(){
  	String s = " _________________________________________\n" + 
  	    "< Hola, soy la vaca %s y tengo %i años! >\n" + 
  	    " -----------------------------------------\n" + 
  	    "        \   ^__^\n" + 
  	    "         \  (oo)\_______\n" + 
  	    "            (__)\       )\\/\\\n" + 
  	    "                ||----w |\n" + 
  	    "                ||     ||\n" +
  	    "#############################################\n";
  	System.out.printf(s, nombre, edad);
      }
  }
#+end_src

Dejaré este dato por aquí
#+begin_src bash
  $ echo "Lola" | cowsay
#+end_src


Clase /Pollito/

#+begin_src java
  /* Archivo Pollito.java */
  import java.util.Scanner;

  public class Pollito {
      // Esto sí se debe hacer
      private String nombre;
      private int edad;

      public void inicializar(){
  	Scanner input = new Scanner(System.in);
  	System.out.print("Ingresa nombre de pollito: ");
  	nombre = input.nextLine();
  	System.out.print("Ingresa edad de pollito: ");
  	edad = input.nextInt();
      }

      public void imprimir(){
  	String s = " _________________________________________\n" +
  	    "< Hola, soy el pollito %s y tengo %i años! >\n" +
  	    "  ----------------------------------------------\n" + 
  	    "        \   \n" + 
  	    "         \  \n" +
  	    "          \ \n" +
  	    "             M\n" +
  	    "           <°v°>\n" +
  	    "            Y Y\n" +
  	    "############################################\n";
  	System.out.printf(s, nombre, edad);
      }
  }	
#+end_src

Y finalmente en otro archivo diferente /Main/

#+begin_src java
  public class Main {
      public static void main (String[] args){
  	Vaca v1 = new Vaca();
  	v1.inicializar();
  	v1.imprimir();

  	Pollito p1 = new Pollito();
  	p1.inicializar();
  	p1.imprimir();
      }
  }
#+end_src

*Nota* Para poder usar otras clases en nuestro /Main/, estas clases
 deben de

+ Estar en la misma carpeta que el /Main/
+ Importarse (como ~import java.util.Scanner;~)
+ Importar el paquete. (pendiente)

Por ahora, los 3 archivos están en la misma carpeta. Y podemos
compilar /todos/ los archivos java como:
#+begin_src bash
  $ ls
  Vaca.java       Pollito.java      Main.java
  $ javac *.java
  $ java Main
#+end_src


Una vez cargado los valores de /Vaca y Pollito/, podríamos cambiar los
atributos de la clase /Vaca/ que son /públicos/ como

#+begin_src java
  public static void main (String[] args){
      //...
      v1.nombre = "Guillermina";
      v1.edad = -10;
      v1.imprimir();
  }
#+end_src

Java nos permite /si es que es público/, asignar a los atributos
valores /directamente/. Por una parte esto es válido porque es lógica,
pero claramente tener una /edad negativa/ no es sensato. *No podemos
modificar atributos _sin que NO lo sepa la clase_*. Lo correcto sería
que la clase misma /autorice/ que se está cambiando un valor suyo; los
atributos son exclusivos de la misma clase y nadie /salvo ella/ puede
modificar sus valores. Esto es la *encapsulación*.

En este ejemplo *sobrepasamos* al objeto ~v1~ y podemos asignar una
edad /negativa!/. Para /informar/ a la clase que estamos modificando
un valor, necesitamos crear un método que haga esta asignación a su variable

#+begin_src java
  public class Vaca {

      // Ahora sí se cumple el encapsulamiento
      private String nombre;
      private int edad;

      public void cambiaNombre(String s){
  	nombre = s;
      }

      // .. más métodos
#+end_src

Así, cuando queramos cambiar el valor a ~nombre~ solo puede ser
posible únicamente a través del método ~cambiaNombre()~.

#+begin_src java
  v1.cambiaNombre("Guillermina");
#+end_src

Incluso, podemos validar que la información que nos pasen sea la
correcta, como en el caso de la edad, si es negativa, simplemente
/ignorar esta entrada/ lo cual nos da un nivel más de /robustez/.

#+begin_src java
  public void cambiaEdad(int n){
      if (n < 0)
  	System.out.println("No se puede asignar edad negativa");
      else
  	edad = n;
  }
#+end_src

De igual forma, no podemos /leer/ los atributos privados directamente
como

#+begin_src java
  String nombreVaca = v1.nombre; //Never
#+end_src

De nuevo, la clase /debe saber/ lo que está pasando con sus variables,
incluso si solo es leer el valor. Por lo que creamos un método que a
través de él nos regrese el valor privado de la clase.

#+begin_src java
  public String obtieneNombre(){
      return nombre;
  }
#+end_src

Por lo que, tenemos siempre 2 tipos de métodos de cajón por cada
variable de clase:

1. Asignar un valor a una variable
2. Obtener un valor de una variable

En la comunidad de /Java/, se ha acordado que estos dos tipos de
métodos (que siempre existen) tengan el prefijo ~set~ y ~get~ para
asignar y leer valores respectivamente. Así tenemos los famosos
/getters/ y /setters/ cuyo único propósito es ser intermediarios
entre el exterior y las variables privadas.

La clase /Pollito/, siguiendo el principio de encapsulación quedaría
como:


#+begin_src java
  /* Archivo Pollito.java */
  import java.util.Scanner;

  public class Pollito {
      // Esto sí se debe hacer
      private String nombre;
      private int edad;

      public void setNombre(String nuevoNombre){
  	nombre = nuevoNombre;
      }

      public String getNombre(){
  	return nombre;
      }

      public void setEdad(int nuevaEdad){
  	if (nuevaEdad < 0 || nuevaEdad > 10)
  	    System.out.println("Los pollos no viven " + nuevaEdad + " años");
  	else
  	    edad = nuevaEdad;
      }

      public String getEdad(){
  	return edad;
      }

      public void inicializar(){
  	Scanner input = new Scanner(System.in);
  	System.out.print("Ingresa nombre de pollito: ");
  	nombre = input.nextLine();
  	System.out.print("Ingresa edad de pollito: ");
  	edad = input.nextInt();
      }

      public void imprimir(){
  	String s = " _________________________________________\n" +
  	    "< Hola, soy el pollito %s y tengo %i años! >\n" +
  	    "  ----------------------------------------------\n" + 
  	    "        \   \n" + 
  	    "         \  \n" +
  	    "          \ \n" +
  	    "             M\n" +
  	    "           <°v°>\n" +
  	    "            Y Y\n" +
  	    "############################################\n";
  	System.out.printf(s, nombre, edad);
      }
  }	
#+end_src

Resumiendo, para seguir el principio de encapsulación en /Java/:

+ Todas las variables de clase deben tener acceso ~private~.
+ Por cada variable debe haber un método ~get~ y ~set~ que hagan
  obtención y asignación de la variable.
+ Cuando se requiera leer u obtener el valor de una variable /fuera de
  la clase/ debemos utilizar ĺos /getters y setters/.

