icc/08_encapsulamiento.html
<div id="outline-container-org56e7c68" class="outline-3">
<h3 id="org56e7c68"><span class="section-number-3">1.1.</span> Ejemplo 1: Vaca y Pollito</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Tenemos dos clases, <i>Vaca y Pollito</i> <b>en 2 archivos diferentes</b> como:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Archivo Vaca.java</span><span style="color: #7f7f7f;"> */</span>
<span style="color: #00bfff;">import</span> <span style="color: #a2cd5a;">java</span>.<span style="color: #a2cd5a;">util</span>.<span style="color: #98f5ff;">Scanner</span>;

<span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Vaca</span> {
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Esto es inaceptable, solo es un ejemplo
</span>    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">edad</span>;

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">inicializar</span>(){
        <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);
        System.out.print(<span style="color: #deb887;">"Ingresa un nombre para la vaca: "</span>);
        nombre = input.nextLine();
        System.out.print(<span style="color: #deb887;">"Ingresa una edad de la vaca: "</span>);
        edad = input.nextLine();
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">imprimir</span>(){
        <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">" _________________________________________\n"</span> + 
            <span style="color: #deb887;">"&lt; Hola, soy la vaca %s y tengo %i a&#241;os! &gt;\n"</span> + 
            <span style="color: #deb887;">" -----------------------------------------\n"</span> + 
            <span style="color: #deb887;">"        \   ^__^\n"</span> + 
            <span style="color: #deb887;">"         \  (oo)\_______\n"</span> + 
            <span style="color: #deb887;">"            (__)\       )\\/\\\n"</span> + 
            <span style="color: #deb887;">"                ||----w |\n"</span> + 
            <span style="color: #deb887;">"                ||     ||\n"</span> +
            <span style="color: #deb887;">"#############################################\n"</span>;
        System.out.printf(s, nombre, edad);
    }
}
</pre>
</div>

<p>
Dejaré este dato por aquí
</p>
<div class="org-src-container">
<pre class="src src-bash">$ echo <span style="color: #deb887;">"Lola"</span> | cowsay
</pre>
</div>


<p>
Clase <i>Pollito</i>
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Archivo Pollito.java</span><span style="color: #7f7f7f;"> */</span>
<span style="color: #00bfff;">import</span> <span style="color: #a2cd5a;">java</span>.<span style="color: #a2cd5a;">util</span>.<span style="color: #98f5ff;">Scanner</span>;

<span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Pollito</span> {
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Esto s&#237; se debe hacer
</span>    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>;

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">inicializar</span>(){
        <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);
        System.out.print(<span style="color: #deb887;">"Ingresa nombre de pollito: "</span>);
        nombre = input.nextLine();
        System.out.print(<span style="color: #deb887;">"Ingresa edad de pollito: "</span>);
        edad = input.nextInt();
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">imprimir</span>(){
        <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">" _________________________________________\n"</span> +
            <span style="color: #deb887;">"&lt; Hola, soy el pollito %s y tengo %i a&#241;os! &gt;\n"</span> +
            <span style="color: #deb887;">"  ----------------------------------------------\n"</span> + 
            <span style="color: #deb887;">"        \   \n"</span> + 
            <span style="color: #deb887;">"         \  \n"</span> +
            <span style="color: #deb887;">"          \ \n"</span> +
            <span style="color: #deb887;">"             M\n"</span> +
            <span style="color: #deb887;">"           &lt;&#176;v&#176;&gt;\n"</span> +
            <span style="color: #deb887;">"            Y Y\n"</span> +
            <span style="color: #deb887;">"############################################\n"</span>;
        System.out.printf(s, nombre, edad);
    }
}       
</pre>
</div>

<p>
Y finalmente en otro archivo diferente <i>Main</i>
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Main</span> {
    <span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
        <span style="color: #98f5ff;">Vaca</span> <span style="color: #4eee94;">v1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Vaca</span>();
        v1.inicializar();
        v1.imprimir();

        <span style="color: #98f5ff;">Pollito</span> <span style="color: #4eee94;">p1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Pollito</span>();
        p1.inicializar();
        p1.imprimir();
    }
}
</pre>
</div>

<p>
<b>Nota</b> Para poder usar otras clases en nuestro <i>Main</i>, estas clases
 deben de
</p>

<ul class="org-ul">
<li>Estar en la misma carpeta que el <i>Main</i></li>
<li>Importarse (como <code>import java.util.Scanner;</code>)</li>
<li>Importar el paquete. (pendiente)</li>
</ul>

<p>
Por ahora, los 3 archivos están en la misma carpeta. Y podemos
compilar <i>todos</i> los archivos java como:
</p>
<div class="org-src-container">
<pre class="src src-bash">$ ls
Vaca.java       Pollito.java      Main.java
$ javac *.java
$ java Main
</pre>
</div>


<p>
Una vez cargado los valores de <i>Vaca y Pollito</i>, podríamos cambiar los
atributos de la clase <i>Vaca</i> que son <i>públicos</i> como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
    <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">...
</span>    v1.nombre = <span style="color: #deb887;">"Guillermina"</span>;
    v1.edad = -10;
    v1.imprimir();
}
</pre>
</div>

<p>
Java nos permite <i>si es que es público</i>, asignar a los atributos
valores <i>directamente</i>. Por una parte esto es válido porque es lógica,
pero claramente tener una <i>edad negativa</i> no es sensato. <b>No podemos
modificar atributos <span class="underline">sin que NO lo sepa la clase</span></b>. Lo correcto sería
que la clase misma <i>autorice</i> que se está cambiando un valor suyo; los
atributos son exclusivos de la misma clase y nadie <i>salvo ella</i> puede
modificar sus valores. Esto es la <b>encapsulación</b>.
</p>

<p>
En este ejemplo <b>sobrepasamos</b> al objeto <code>v1</code> y podemos asignar una
edad <i>negativa!</i>. Para <i>informar</i> a la clase que estamos modificando
un valor, necesitamos crear un método que haga esta asignación a su variable
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Vaca</span> {

    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Ahora s&#237; se cumple el encapsulamiento
</span>    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>;

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">cambiaNombre</span>(<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span>){
        nombre = s;
    }

    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">.. m&#225;s m&#233;todos</span>
</pre>
</div>

<p>
Así, cuando queramos cambiar el valor a <code>nombre</code> solo puede ser
posible únicamente a través del método <code>cambiaNombre()</code>.
</p>

<div class="org-src-container">
<pre class="src src-java">v1.cambiaNombre(<span style="color: #deb887;">"Guillermina"</span>);
</pre>
</div>

<p>
Incluso, podemos validar que la información que nos pasen sea la
correcta, como en el caso de la edad, si es negativa, simplemente
<i>ignorar esta entrada</i> lo cual nos da un nivel más de <i>robustez</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">cambiaEdad</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">n</span>){
    <span style="color: #00bfff;">if</span> (n &lt; 0)
        System.out.println(<span style="color: #deb887;">"No se puede asignar edad negativa"</span>);
    <span style="color: #00bfff;">else</span>
        edad = n;
}
</pre>
</div>

<p>
De igual forma, no podemos <i>leer</i> los atributos privados directamente
como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombreVaca</span> = v1.nombre; <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">Never</span>
</pre>
</div>

<p>
De nuevo, la clase <i>debe saber</i> lo que está pasando con sus variables,
incluso si solo es leer el valor. Por lo que creamos un método que a
través de él nos regrese el valor privado de la clase.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">obtieneNombre</span>(){
    <span style="color: #00bfff;">return</span> nombre;
}
</pre>
</div>

<p>
Por lo que, tenemos siempre 2 tipos de métodos de cajón por cada
variable de clase:
</p>

<ol class="org-ol">
<li>Asignar un valor a una variable</li>
<li>Obtener un valor de una variable</li>
</ol>

<p>
En la comunidad de <i>Java</i>, se ha acordado que estos dos tipos de
métodos (que siempre existen) tengan el prefijo <code>set</code> y <code>get</code> para
asignar y leer valores respectivamente. Así tenemos los famosos
<i>getters</i> y <i>setters</i> cuyo único propósito es ser intermediarios
entre el exterior y las variables privadas.
</p>

<p>
La clase <i>Pollito</i>, siguiendo el principio de encapsulación quedaría
como:
</p>


<div class="org-src-container">
<pre class="src src-java"><span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Archivo Pollito.java</span><span style="color: #7f7f7f;"> */</span>
<span style="color: #00bfff;">import</span> <span style="color: #a2cd5a;">java</span>.<span style="color: #a2cd5a;">util</span>.<span style="color: #98f5ff;">Scanner</span>;

<span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Pollito</span> {
    <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Esto s&#237; se debe hacer
</span>    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>;

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">setNombre</span>(<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nuevoNombre</span>){
        nombre = nuevoNombre;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">getNombre</span>(){
        <span style="color: #00bfff;">return</span> nombre;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">setEdad</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">nuevaEdad</span>){
        <span style="color: #00bfff;">if</span> (nuevaEdad &lt; 0 || nuevaEdad &gt; 10)
            System.out.println(<span style="color: #deb887;">"Los pollos no viven "</span> + nuevaEdad + <span style="color: #deb887;">" a&#241;os"</span>);
        <span style="color: #00bfff;">else</span>
            edad = nuevaEdad;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">getEdad</span>(){
        <span style="color: #00bfff;">return</span> edad;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">inicializar</span>(){
        <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);
        System.out.print(<span style="color: #deb887;">"Ingresa nombre de pollito: "</span>);
        nombre = input.nextLine();
        System.out.print(<span style="color: #deb887;">"Ingresa edad de pollito: "</span>);
        edad = input.nextInt();
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">imprimir</span>(){
        <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">" _________________________________________\n"</span> +
            <span style="color: #deb887;">"&lt; Hola, soy el pollito %s y tengo %i a&#241;os! &gt;\n"</span> +
            <span style="color: #deb887;">"  ----------------------------------------------\n"</span> + 
            <span style="color: #deb887;">"        \   \n"</span> + 
            <span style="color: #deb887;">"         \  \n"</span> +
            <span style="color: #deb887;">"          \ \n"</span> +
            <span style="color: #deb887;">"             M\n"</span> +
            <span style="color: #deb887;">"           &lt;&#176;v&#176;&gt;\n"</span> +
            <span style="color: #deb887;">"            Y Y\n"</span> +
            <span style="color: #deb887;">"############################################\n"</span>;
        System.out.printf(s, nombre, edad);
    }
}       
</pre>
</div>

<p>
Resumiendo, para seguir el principio de encapsulación en <i>Java</i>:
</p>

<ul class="org-ul">
<li>Todas las variables de clase deben tener acceso <code>private</code>.</li>
<li>Por cada variable debe haber un método <code>get</code> y <code>set</code> que hagan
obtención y asignación de la variable.</li>
<li>Cuando se requiera leer u obtener el valor de una variable <i>fuera de
la clase</i> debemos utilizar ĺos <i>getters y setters</i>.</li>
</ul>
</div>
</div>
