icc/08_encapsulamiento.org
** Problema 1: Gatos++

De la clase /Gato/ programada anteriormente, modifícala para que ahora
cumpla con el principio de encapsulación.

** Problema 2: Caja

Crea una clase /Caja/ que tenga como atributos

+ ID de caja (~int~)
+ Contenido de la caja (~String~)
+ Color de la caja (~String~)

con los métodos /no estáticos/
- ~inicializar()~
- ~getters~ y ~setters~
- - ~imprimir()~ La cadena impresa debe ser como
  #+begin_example
  +---- ID de la caja ----+
  |-----------------------|
  |  contenido de la caja |
  |  COLOR: ColorCaja     |
  +-----------------------+
  #+end_example
  Nota que la caja deberá ajustarse en tamaño al nombre y al
  contenido. 

* Constructor

Ya que nuestras variables de clase /deben inicializarse/ hay que
llamar al método ~inicializar()~, donde leemos uno por uno los valores
que tendrá.

 #+begin_src java
   public void inicializar(){
       Scanner input = new Scanner(System.in);
       System.out.print("Ingresa nombre de pollito: ");
       nombre = input.nextLine();
       System.out.print("Ingresa edad de pollito: ");
       edad = input.nextInt();
   }
 #+end_src

 /Java/ nos provee de un /constructor de clase/ para poder inicializar
 estas variables de antemano, si es lo que sabemos. Un /constructor/
 es un método especial que tiene la excepción de:

1. Llamarse igual que la clase
2. Ser un método.
3. Es el primer método que se ejecuta de la clase

Su único propósito es dejar a la clase /lista/ en valores cuando se
termine de crear con el operador ~new~. Es básicamente un
incializador. Hasta ahora solo hemos utilizado el constructor /vacío/
que inicializa todo en valores mínimos, pero lo podemos
/sobreescribir/. Podríamos hacer el constructor de /Pollito/ como

#+begin_src java
  /* Constructor de la clase Pollito.java */
  public Pollito(){
      inicializar();
  }
#+end_src

para poder ahorrarnos llamar al método ~inicializar()~ una vez creado
el objeto

#+begin_src java
  public static void main (String[] args){
      Pollito p1 = new Pollito();
      //p1.inicializar() se ejecutó al momento de crear Pollito()
      p1.imprimir();
#+end_src

Mejor aún, podríamos ahorrarnos escribir incluso el método
~inicializar()~ si directamente su código lo ponemos en el constructor
como

#+begin_src java
  /* Constructor de la clase Pollito.java */
  public Pollito(){
      Scanner input = new Scanner(System.in);
      System.out.print("Ingresa nombre de pollito: ");
      nombre = input.nextLine();
      System.out.print("Ingresa edad de pollito: ");
      edad = input.nextInt();
  }
#+end_src

Pero la manera óptima es pasarle los valores al constructor como
parámetro y no utilizar el objeto  ~Scanner~ en lo absoluto! 

#+begin_src java
  public Pollito(String nombre, int edad){
      this.nombre = nombre;
      this.edad = edad;
  }
#+end_src

*Nota*: Ya que la /variable de clase/ se llama ~nombre~, y el
 /parámetro del constructor/ se llama ~nombre~, /Java/ no puede
 identificar en qué variable asignará qué. Por esto se utiliza la
 palabra reservada ~this~. ~this~ hace referencia a /esta clase/ desde
 /dentro de la clase/, o simplemente para referirse a los atributos y
 métodos de la clase y evitar /ambiguedad/.

 Los valores de ~nombre~ y ~edad~ se los podemos pasar desde el
 ~main~. Así estamos creando /alta cohesion/ a nuestro objeto, lo que
 significa: Enfocate solamente en /Pollito/, cosas como ~Scanner~ no
 tienen nada que ver con un /Pollito/, por lo que nuestro objeto solo
 se debe de preocupar de cosas de /Pollito/.

#+begin_src java
  public static void main (String[] args){

      Scanner input = new Scanner(System.in);
      System.out.print("Ingresa nombre de pollito: ");
      nombre = input.nextLine();
      System.out.print("Ingresa edad de pollito: ");
      edad = input.nextInt();
      
      Pollito p1 = new Pollito(nombre, edad);
      p1.imprimir();
  }
#+end_src

