icc/08_encapsulamiento.html
<div id="outline-container-org48573bf" class="outline-3">
<h3 id="org48573bf"><span class="section-number-3">1.2.</span> Problema 1: Gatos++</h3>
<div class="outline-text-3" id="text-1-2">
<p>
De la clase <i>Gato</i> programada anteriormente, modifícala para que ahora
cumpla con el principio de encapsulación.
</p>
</div>
</div>
<div id="outline-container-org5f84811" class="outline-3">
<h3 id="org5f84811"><span class="section-number-3">1.3.</span> Problema 2: Caja</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Crea una clase <i>Caja</i> que tenga como atributos
</p>

<ul class="org-ul">
<li>ID de caja (<code>int</code>)</li>
<li>Contenido de la caja (<code>String</code>)</li>
<li>Color de la caja (<code>String</code>)</li>
</ul>

<p>
con los métodos <i>no estáticos</i>
</p>
<ul class="org-ul">
<li><code>inicializar()</code></li>
<li><code>getters, setters</code></li>
<li><p>
<code>imprimir()</code> La cadena impresa debe ser como
</p>
<pre class="example" id="org727c36a">
+---- ID de la caja ----+
|-----------------------|
|  contenido de la caja |
|  COLOR: ColorCaja     |
+-----------------------+
</pre>
<p>
Nota que la caja deberá ajustarse en tamaño al nombre y al
contenido. 
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org18461ca" class="outline-3">
<h3 id="org18461ca"><span class="section-number-3">1.4.</span> Constructor</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Ya que nuestras variables de clase <i>deben inicializarse</i> hay que
llamar al método <code>inicializar()</code>, donde leemos uno por uno los valores
que tendrá.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">inicializar</span>(){
    <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);
    System.out.print(<span style="color: #deb887;">"Ingresa nombre de pollito: "</span>);
    nombre = input.nextLine();
    System.out.print(<span style="color: #deb887;">"Ingresa edad de pollito: "</span>);
    edad = input.nextInt();
}
</pre>
</div>

<p>
<i>Java</i> nos provee de un <i>constructor de clase</i> para poder inicializar
estas variables de antemano, si es lo que sabemos. Un <i>constructor</i>
es un método especial que tiene la excepción de:
</p>

<ol class="org-ol">
<li>Llamarse igual que la clase</li>
<li>Ser un método.</li>
<li>Es el primer método que se ejecuta de la clase</li>
</ol>

<p>
Su único propósito es dejar a la clase <i>lista</i> en valores cuando se
termine de crear con el operador <code>new</code>. Es básicamente un
incializador. Hasta ahora solo hemos utilizado el constructor <i>vacío</i>
que inicializa todo en valores mínimos, pero lo podemos
<i>sobreescribir</i>. Podríamos hacer el constructor de <i>Pollito</i> como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Constructor de la clase Pollito.java</span><span style="color: #7f7f7f;"> */</span>
<span style="color: #00bfff;">public</span> Pollito(){
    inicializar();
}
</pre>
</div>

<p>
para poder ahorrarnos llamar al método <code>inicializar()</code> una vez creado
el objeto
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
    <span style="color: #98f5ff;">Pollito</span> <span style="color: #4eee94;">p1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Pollito</span>();
    <span style="color: #7f7f7f;">//</span><span style="color: #7f7f7f;">p1.inicializar() se ejecut&#243; al momento de crear Pollito()
</span>    p1.imprimir();
</pre>
</div>

<p>
Mejor aún, podríamos ahorrarnos escribir incluso el método
<code>inicializar()</code> si directamente su código lo ponemos en el constructor
como
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #7f7f7f;">/* </span><span style="color: #7f7f7f;">Constructor de la clase Pollito.java</span><span style="color: #7f7f7f;"> */</span>
<span style="color: #00bfff;">public</span> Pollito(){
    <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);
    System.out.print(<span style="color: #deb887;">"Ingresa nombre de pollito: "</span>);
    nombre = input.nextLine();
    System.out.print(<span style="color: #deb887;">"Ingresa edad de pollito: "</span>);
    edad = input.nextInt();
}
</pre>
</div>

<p>
Pero la manera óptima es pasarle los valores al constructor como
parámetro y no utilizar el objeto  <code>Scanner</code> en lo absoluto! 
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> Pollito(<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>){
    <span style="color: #00bfff;">this</span>.nombre = nombre;
    <span style="color: #00bfff;">this</span>.edad = edad;
}
</pre>
</div>

<p>
<b>Nota</b>: Ya que la <i>variable de clase</i> se llama <code>nombre</code>, y el
 <i>parámetro del constructor</i> se llama <code>nombre</code>, <i>Java</i> no puede
 identificar en qué variable asignará qué. Por esto se utiliza la
 palabra reservada <code>this</code>. <code>this</code> hace referencia a <i>esta clase</i> desde
 <i>dentro de la clase</i>, o simplemente para referirse a los atributos y
 métodos de la clase y evitar <i>ambiguedad</i>.
</p>

<p>
Los valores de <code>nombre</code> y <code>edad</code> se los podemos pasar desde el
<code>main</code>. Así estamos creando <i>alta cohesion</i> a nuestro objeto, lo que
significa: Enfocate solamente en <i>Pollito</i>, cosas como <code>Scanner</code> no
tienen nada que ver con un <i>Pollito</i>, por lo que nuestro objeto solo
se debe de preocupar de cosas de <i>Pollito</i>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){

    <span style="color: #98f5ff;">Scanner</span> <span style="color: #4eee94;">input</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Scanner</span>(System.in);
    System.out.print(<span style="color: #deb887;">"Ingresa nombre de pollito: "</span>);
    nombre = input.nextLine();
    System.out.print(<span style="color: #deb887;">"Ingresa edad de pollito: "</span>);
    edad = input.nextInt();

    <span style="color: #98f5ff;">Pollito</span> <span style="color: #4eee94;">p1</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Pollito</span>(nombre, edad);
    p1.imprimir();
}
</pre>
</div>
</div>
</div>
