icc/08_encapsulamiento.org
* ToString

Todos los objetos en /Java/ tienen un método /heredado de Object/
llamado ~toString()~. Sirve para dar una representación en cadena del
objeto mismo, exactamente lo que hace el método ~imprimir()~, pero con
un poco más de elegancia.

Muchas veces es importante imprimir una representación del objeto como
sigue

#+begin_src java
  public static void main (String[] args){
      Vaca v = new Vaca("Lola", 22); // Constructor óptimo
      System.out.println(v.toString());
  }
#+end_src

Aunque no hemos /programado/ el método ~toString()~ lo tenemos porque
es heredado. Más adelante veremos qué es esto. En la consola nos
aparecería algo como

#+begin_src bash
  $ javac Main.java && java Main
  Vaca@2a139a55
#+end_src

Lo que aparece es la /direccion de memoria/ del objeto en cuestión, lo
que es /exactamente/ su *identificador*, obviamente en un ~String~. El
método ~toString()~ podemos /modificarlo/ para que en lugar de que nos
imprima la dirección en memoria del objeto, nos imprima la cadena que
hemos definido anteriormente.

#+begin_src java
  @Override
  public String toString(){
      String s = " _________________________________________\n" + 
  	"< Hola, soy la vaca %s y tengo %i años! >\n" + 
  	" -----------------------------------------\n" + 
  	"        \   ^__^\n" + 
  	"         \  (oo)\_______\n" + 
  	"            (__)\       )\\/\\\n" + 
  	"                ||----w |\n" + 
  	"                ||     ||\n" +
  	"#############################################\n";
      return s;
  }
#+end_src

*Nota*: No estamos imprimiendo la cadena, mejor aún la /regresamos/
para que esta cadena pueda servir para más que solo imprimir en
pantalla! Como por ejemplo, mandarla en un chat, guardarla a un
archivo etc.

La anotación ~@Override~ significa que estamos /sobrecargando/ el
método, es decir si ya estaba implementado el método (claramente sí,
cuando imprimía la dirección de memoria), lo /reimplementa/ o
/sobreescribe/ su código por nuestro código.

El código de la clase /Vaca/ siguiendo el paradigma de /Programación
orientada a objetos/ con las mejores prácticas queda como
#+begin_src java
  public class Vaca {
      
      private String nombre;
      private int edad;

      public Vaca(String nombre, int edad){
  	this.nombre = nombre;
  	this.edad = edad;
      }

      public String getNombre(){
  	return nombre;
      }

      public void setNombre(String nombre){
  	if (nombre.equals(""))
  	    System.out.println("Nombre no válido");
  	else 
  	    this.nombre = nombre;
      }

      public int getEdad(){
  	return edad;
      }

      public void setEdad(int edad){
  	if (edad < 0 || edad > 20)
  	    System.out.println("El tiempo de vida de una vaca es de 0 a 20 años");
  	else
  	    this.edad = edad;
      }

      @Override
      public String toString(){
  	String s = " _________________________________________\n" + 
  	    "< Hola, soy la vaca %s y tengo %i años! >\n" + 
  	    " -----------------------------------------\n" + 
  	    "        \   ^__^\n" + 
  	    "         \  (oo)\_______\n" + 
  	    "            (__)\       )\\/\\\n" + 
  	    "                ||----w |\n" + 
  	    "                ||     ||\n" +
  	    "#############################################\n";
  	return s;
      }
  }      
#+end_src

Con esto terminamos /parcialmente/ el uso de métodos  en
/Java/. Existen otras variaciones, pero por ahora es más que suficiente.

** Problema 3 y 4. Cajas++

Modifica las clases de ~Vaca, Pollito, Gato, Caja~ para que tengan las
mejores prácticas de programación, es decir:

+ Constructor de clase
+ Encapsulamiento de datos
+ Método toString()


[[file:07_metodos.html][Anterior]]
