icc/08_encapsulamiento.html
<div id="outline-container-org8e084f2" class="outline-3">
<h3 id="org8e084f2"><span class="section-number-3">1.5.</span> ToString</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Todos los objetos en <i>Java</i> tienen un método <i>heredado de Object</i>
llamado <code>toString()</code>. Sirve para dar una representación en cadena del
objeto mismo, exactamente lo que hace el método <code>imprimir()</code>, pero con
un poco más de elegancia.
</p>

<p>
Muchas veces es importante imprimir una representación del objeto como
sigue
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">static</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">main</span> (<span style="color: #98f5ff;">String</span>[] <span style="color: #4eee94;">args</span>){
    <span style="color: #98f5ff;">Vaca</span> <span style="color: #4eee94;">v</span> = <span style="color: #00bfff;">new</span> <span style="color: #98f5ff;">Vaca</span>(<span style="color: #deb887;">"Lola"</span>, 22); <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">Constructor &#243;ptimo
</span>    System.out.println(v.toString());
}
</pre>
</div>

<p>
Aunque no hemos <i>programado</i> el método <code>toString()</code> lo tenemos porque
es heredado. Más adelante veremos qué es esto. En la consola nos
aparecería algo como
</p>

<div class="org-src-container">
<pre class="src src-bash">$ javac Main.java &amp;&amp; java Main
Vaca@2a139a55
</pre>
</div>

<p>
Lo que aparece es la <i>direccion de memoria</i> del objeto en cuestión, lo
que es <i>exactamente</i> su <b>identificador</b>, obviamente en un <code>String</code>. El
método <code>toString()</code> podemos <i>modificarlo</i> para que en lugar de que nos
imprima la dirección en memoria del objeto, nos imprima la cadena que
hemos definido anteriormente.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #a2cd5a;">@Override</span>
<span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">toString</span>(){
    <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">" _________________________________________\n"</span> + 
        <span style="color: #deb887;">"&lt; Hola, soy la vaca %s y tengo %i a&#241;os! &gt;\n"</span> + 
        <span style="color: #deb887;">" -----------------------------------------\n"</span> + 
        <span style="color: #deb887;">"        \   ^__^\n"</span> + 
        <span style="color: #deb887;">"         \  (oo)\_______\n"</span> + 
        <span style="color: #deb887;">"            (__)\       )\\/\\\n"</span> + 
        <span style="color: #deb887;">"                ||----w |\n"</span> + 
        <span style="color: #deb887;">"                ||     ||\n"</span> +
        <span style="color: #deb887;">"#############################################\n"</span>;
    <span style="color: #00bfff;">return</span> s;
}
</pre>
</div>

<p>
<b>Nota</b>: No estamos imprimiendo la cadena, mejor aún la <i>regresamos</i>
para que esta cadena pueda servir para más que solo imprimir en
pantalla! Como por ejemplo, mandarla en un chat, guardarla a un
archivo etc.
</p>

<p>
La anotación <code>@Override</code> significa que estamos <i>sobrecargando</i> el
método, es decir si ya estaba implementado el método (claramente sí,
cuando imprimía la dirección de memoria), lo <i>reimplementa</i> o
<i>sobreescribe</i> su código por nuestro código.
</p>

<p>
El código de la clase <i>Vaca</i> siguiendo el paradigma de <i>Programación
orientada a objetos</i> con las mejores prácticas queda como
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #00bfff;">public</span> <span style="color: #00bfff;">class</span> <span style="color: #98f5ff;">Vaca</span> {

    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>;
    <span style="color: #00bfff;">private</span> <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>;

    <span style="color: #00bfff;">public</span> Vaca(<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>, <span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>){
        <span style="color: #00bfff;">this</span>.nombre = nombre;
        <span style="color: #00bfff;">this</span>.edad = edad;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">getNombre</span>(){
        <span style="color: #00bfff;">return</span> nombre;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">setNombre</span>(<span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">nombre</span>){
        <span style="color: #00bfff;">if</span> (nombre.equals(<span style="color: #deb887;">""</span>))
            System.out.println(<span style="color: #deb887;">"Nombre no v&#225;lido"</span>);
        <span style="color: #00bfff;">else</span> 
            <span style="color: #00bfff;">this</span>.nombre = nombre;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">int</span> <span style="color: #daa520;">getEdad</span>(){
        <span style="color: #00bfff;">return</span> edad;
    }

    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">void</span> <span style="color: #daa520;">setEdad</span>(<span style="color: #98f5ff;">int</span> <span style="color: #4eee94;">edad</span>){
        <span style="color: #00bfff;">if</span> (edad &lt; 0 || edad &gt; 20)
            System.out.println(<span style="color: #deb887;">"El tiempo de vida de una vaca es de 0 a 20 a&#241;os"</span>);
        <span style="color: #00bfff;">else</span>
            <span style="color: #00bfff;">this</span>.edad = edad;
    }

    <span style="color: #a2cd5a;">@Override</span>
    <span style="color: #00bfff;">public</span> <span style="color: #98f5ff;">String</span> <span style="color: #daa520;">toString</span>(){
        <span style="color: #98f5ff;">String</span> <span style="color: #4eee94;">s</span> = <span style="color: #deb887;">" _________________________________________\n"</span> + 
            <span style="color: #deb887;">"&lt; Hola, soy la vaca %s y tengo %i a&#241;os! &gt;\n"</span> + 
            <span style="color: #deb887;">" -----------------------------------------\n"</span> + 
            <span style="color: #deb887;">"        \   ^__^\n"</span> + 
            <span style="color: #deb887;">"         \  (oo)\_______\n"</span> + 
            <span style="color: #deb887;">"            (__)\       )\\/\\\n"</span> + 
            <span style="color: #deb887;">"                ||----w |\n"</span> + 
            <span style="color: #deb887;">"                ||     ||\n"</span> +
            <span style="color: #deb887;">"#############################################\n"</span>;
        <span style="color: #00bfff;">return</span> s;
    }
}      
</pre>
</div>

<p>
Con esto terminamos <i>parcialmente</i> el uso de métodos  en
<i>Java</i>. Existen otras variaciones, pero por ahora es más que suficiente.
</p>
</div>
</div>
<div id="outline-container-org5cb960e" class="outline-3">
<h3 id="org5cb960e"><span class="section-number-3">1.6.</span> Problema 3 y 4. Cajas++</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Modifica las clases de <code>Vaca, Pollito, Gato, Caja</code> para que tengan las
mejores prácticas de programación, es decir:
</p>

<ul class="org-ul">
<li>Constructor de clase</li>
<li>Encapsulamiento de datos</li>
<li>Método toString()</li>
</ul>


<p>
<a href="07_metodos.html">Anterior</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davidshiro Pichu</p>
<p class="date">Created: 2025-07-18 Fri 19:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
